In [67]:
import pandas as pd

In [68]:
data={
    'Name':['Ashwini','Minnu','Vaishu'],
    'Age':[20,14,17],
    'City':['Nirmal',"Hyderabad","Bhainsa"]
}
df=pd.DataFrame(data)
print(df)

      Name  Age       City
0  Ashwini   20     Nirmal
1    Minnu   14  Hyderabad
2   Vaishu   17    Bhainsa

In [69]:
s=pd.Series([10,20,30])
print(s)

0    10
1    20
2    30
dtype: int64

In [70]:
df.head()
df.tail()
df.shape
df.columns
df.info()
df.describe()
df['Age'].unique()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

array([20, 14, 17], dtype=int64)

In [71]:
df[['Name','Age']]

      Name  Age
0  Ashwini   20
1    Minnu   14
2   Vaishu   17

In [72]:
df.iloc[0:,:-2]

      Name
0  Ashwini
1    Minnu
2   Vaishu

In [73]:
df.iloc[-1]

Name     Vaishu
Age          17
City    Bhainsa
Name: 2, dtype: object

In [74]:
df[df['Age']<=15]

    Name  Age       City
1  Minnu   14  Hyderabad

In [75]:
df['Salary']=[5000,10000,15000]
df["Mobile.No"]=[1234567890,8765432190,896541230]
df

      Name  Age       City  Salary   Mobile.No
0  Ashwini   20     Nirmal    5000  1234567890
1    Minnu   14  Hyderabad   10000  8765432190
2   Vaishu   17    Bhainsa   15000   896541230

In [76]:
df['Age']=df['Age']+4
df

      Name  Age       City  Salary   Mobile.No
0  Ashwini   24     Nirmal    5000  1234567890
1    Minnu   18  Hyderabad   10000  8765432190
2   Vaishu   21    Bhainsa   15000   896541230

In [77]:
df.drop('Salary',axis=1,inplace=True)
df

      Name  Age       City   Mobile.No
0  Ashwini   24     Nirmal  1234567890
1    Minnu   18  Hyderabad  8765432190
2   Vaishu   21    Bhainsa   896541230

In [81]:
df.loc[3] = ['Pradha', 24, 'mumbai','Nans']
print(df)

      Name  Age       City   Mobile.No
0  Ashwini   24     Nirmal  1234567890
1    Minnu   18  Hyderabad  8765432190
2   Vaishu   21    Bhainsa   896541230
3   Pradha   24     mumbai        Nans

In [83]:
df.fillna(df)

      Name  Age       City   Mobile.No
0  Ashwini   24     Nirmal  1234567890
1    Minnu   18  Hyderabad  8765432190
2   Vaishu   21    Bhainsa   896541230
3   Pradha   24     mumbai        Nans

In [84]:
df['City'].value_counts()
pd.crosstab(df['City'],df['Age'])

Age        18  21  24
City
Bhainsa     0   1   0
Hyderabad   1   0   0
Nirmal      0   0   1
mumbai      0   0   1